#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	Если Оплачено тогда
		Движения.ДенежныйОборот.Записывать = Истина;
		Движение = Движения.ДенежныйОборот.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Работы = ВидРабот;
		Движение.Заказчик = Заказчик;
		Движение.ОплаченнаяСумма = СуммаОплаты;
		Движение.ДатаОплаты = ДатаОплаты;

		НаборЗаписей = РегистрыНакопления.ПредварительныйОборот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать();
	Иначе
		// регистр ДенежныйОборот Приход
		Движения.ПредварительныйОборот.Записывать = Истина;
		Движение = Движения.ПредварительныйОборот.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Работы = ВидРабот;
		Движение.Заказчик = Заказчик;
		Движение.ПредварительнаяСумма = ПредварительнаяСумма;
		
		НаборЗаписей = РегистрыНакопления.ДенежныйОборот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать();

	КонецЕсли;
	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
#КонецОбласти